IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_RINGACC_0_RINGACC_GCFG.xml
<module name="DMASS0_RINGACC_0_RINGACC_GCFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RINGACC_GCFG_revision" acronym="RINGACC_GCFG_revision" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="MODID" width="16" begin="31" end="16" resetval="0x26172" description="Module ID field" range="31 - 16" rwaccess="R"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x0" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="RINGACC_GCFG_trace_ctl" acronym="RINGACC_GCFG_trace_ctl" offset="0x10" width="32" description="Trace Control Register">
		<bitfield id="EN" width="1" begin="31" end="31" resetval="0x0" description="Trace enable 0 = disable 1 = enable." range="31" rwaccess="R/W"/> 
		<bitfield id="ALL_QUEUES" width="1" begin="30" end="30" resetval="0x0" description="Trace everything 0 = only the selected queue 1 = every queue." range="30" rwaccess="R/W"/> 
		<bitfield id="MSG" width="1" begin="29" end="29" resetval="0x0" description="Trace message data 0 = include only the operation 1 = include message data." range="29" rwaccess="R/W"/> 
		<bitfield id="QUEUE" width="16" begin="15" end="0" resetval="0x0" description="Queue number when tracing a single queue." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_GCFG_overflow" acronym="RINGACC_GCFG_overflow" offset="0x20" width="32" description="Overflow Queue Register">
		<bitfield id="QUEUE" width="16" begin="15" end="0" resetval="0x0" description="Queue to send overflow messages. A value of 0xffff will disable the overflow function." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_GCFG_error_evt" acronym="RINGACC_GCFG_error_evt" offset="0x40" width="32" description="The Error Event Register is an Output Event Steering 'OES' register that specifies the event number used to denote detection of a ring memory transaction bus error.">
		<bitfield id="EVT" width="16" begin="15" end="0" resetval="0x65535" description="Event to send when detecting a bus error." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_GCFG_error_log" acronym="RINGACC_GCFG_error_log" offset="0x44" width="32" description="Error Log Register. A read of this register will clear the pending error log event and allow a new error to be captured. It does not clear the contents of this register which are only valid while the error event is pending.">
		<bitfield id="PUSH" width="1" begin="31" end="31" resetval="0x0" description="Bus error was caused by a push. 0 = pop. 1 = push." range="31" rwaccess="R"/> 
		<bitfield id="QUEUE" width="16" begin="15" end="0" resetval="0x0" description="Queue that received the bus error." range="15 - 0" rwaccess="R"/>
	</register>
</module>